ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR-KV58F220M/SDK/platform/hal/src/sim/MKV58F24/fsl_sim_hal_MKV58F24.h
/*! @brief SIM ADCx pre-trigger select */
typedef enum _sim_adc_pretrg_sel
{
    kSimAdcPretrgselA,              /*!< Pre-trigger A selected for ADCx */
    kSimAdcPretrgselB               /*!< Pre-trigger B selected for ADCx */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_adc_pretrg_sel_kv58f24_t;
#else
} sim_adc_pretrg_sel_t;
#endif

/*! @brief DAC0 Hardware Trigger Input Source */
typedef enum _sim_dac_hw_trg_sel
{
    kSimDacHwTrgSelXbarout15   = 0U,    /* XBARA output 15  */
    kSimDacHwTrgSelPdb01Int    = 1U,    /* both PDB0 interval trigger 0 and PDB1 interval trigger 0  */
    kSimDacHwTrgSelPdb0Int     = 2U,    /* PDB0 interval trigger 0  */
    kSimDacHwTrgSelPdb1Int     = 3U,    /* PDB1 interval trigger 0  */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_dac_hw_trg_sel_kv58f24;
#else
} sim_dac_hw_trg_sel;
#endif

/*! @brief the ewm_in source of EWM module. */
typedef enum _sim_ewm_in_src
{
    kSimDacHwTrgSelXbarout58   = 0U,    /* XBARA output 58  */
    kSimDacHwTrgSelEwnInPin    = 1U,    /* EWM_IN Pin  */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_ewm_in_src_kv58f24;
#else
} sim_ewm_in_src;
#endif

/*! @brief CMP Sample/Window Input X Source*/
typedef enum _sim_cmp_win_in_src
{
    kSimCmpWinInSrcXbarout   = 0U,    /* XBARA output - Refer RM for specific module  */
    kSimCmpWinInSrcPdb01Int  = 1U,    /* CMP0 Sample/Window input driven by both PDB0 and PDB1 pulse-out channel 0  */
    kSimCmpWinInSrcPdb0Int   = 2U,    /* PDB0 interval trigger 0  */
    kSimCmpWinInSrcPdb1Int   = 3U,    /* PDB1 interval trigger 0  */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_cmp_win_in_src_kv58f24;
#else
} sim_cmp_win_in_src;
#endif

/*! @brief LPTMR clock source select */
typedef enum _clock_lptmr_src_t
{
    kClockLptmrSrcMcgIrClk,        /*!< MCGIRCLK  */
    kClockLptmrSrcLpoClk,          /*!< LPO clock      */
    kClockLptmrSrcEr32kClk,        /*!< ERCLK32K clock */
    kClockLptmrSrcOsc0erClkUndiv,  /*!< OSCERCLK_UNDIV clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_lptmr_src_kv58f24_t;
#else
} clock_lptmr_src_t;
#endif

/*! @brief SIM PLLFLLSEL clock source select */
typedef enum _clock_pllfll_sel
{
    kClockPllFllSelFll     = 0U,    /*!< Fll clock  */
    kClockPllFllSelPll     = 1U     /*!< Pll0 clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_pllfll_sel_kv58f24_t;
#else
} clock_pllfll_sel_t;
#endif

/*! @brief SIM external reference clock source select (OSC32KSEL). */
typedef enum _clock_er32k_src
{
    kClockEr32kSrcOsc0 = 0U, /*!< OSC0 clock (OSC032KCLK).  */
    kClockEr32kSrcLpo  = 3U, /*!< LPO clock.                */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_er32k_src_kv58f24_t;
#else
} clock_er32k_src_t;
#endif

/*! @brief SIM CLKOUT_SEL clock source select */
typedef enum _clock_clkout_src
{
    kClockClkoutSelFlexbusClk     = 0U,  /*!< Flexbus clock        */
    kClockClkoutSelFlashClk       = 2U,  /*!< Flash clock          */
    kClockClkoutSelLpoClk         = 3U,  /*!< LPO clock            */
    kClockClkoutSelMcgIrClk       = 4U,  /*!< MCGIRCLK             */
    kClockClkoutSelOsc0erClkUndiv = 5U,  /*!< OSCERCLK_UNDIV clock */
    kClockClkoutSelOsc0erClk      = 6U,  /*!< OSC0ERCLK            */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_clkout_src_kv58f24_t;
#else
} clock_clkout_src_t;
#endif

/*! @brief SIM timestamp clock source */
typedef enum _clock_time_src
{
    kClockTimeSrcCoreSysClk,  /*!< Core/system clock                       */
    kClockTimeSrcPllFllSel,   /*!< clock as selected by SOPT2[PLLFLLSEL].  */
    kClockTimeSrcOsc0erClk,   /*!< OSCERCLK clock                          */
    kClockTimeSrcExt          /*!< ENET 1588 clock in (ENET_1588_CLKIN)    */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_time_src_kv58f24_t;
#else
} clock_time_src_t;
#endif

/*! @brief SIM RMII clock source */
typedef enum _clock_rmii_src
{
    kClockRmiiSrcExtalClk,    /*!< EXTAL Clock                           */
    kClockRmiiSrcExt          /*!< ENET 1588 clock in (ENET_1588_CLKIN)  */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_rmii_src_kv58f24_t;
#else
} clock_rmii_src_t;
#endif

/*! @brief FLEXCAN clock source select */
typedef enum _clock_flexcan_src_t
{
    kClockFlexcanSrcOsc0erClk,    /*!< OSCERCLK  */
    kClockFlexcanSrcBusClk        /*!< Bus clock */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} clock_flexcan_src_kv58f24_t;
#else
} clock_flexcan_src_t;
#endif

/*! @brief SIM SCGC bit index. */
#define FSL_SIM_SCGC_BIT(SCGCx, n) (((SCGCx-1U)<<5U) + n)

/*! @brief Clock gate name used for SIM_HAL_EnableClock/SIM_HAL_DisableClock. */
typedef enum _sim_clock_gate_name
{
    kSimClockGateUart4     = FSL_SIM_SCGC_BIT(1U, 10U),
    kSimClockGateUart5     = FSL_SIM_SCGC_BIT(1U, 11U),
    kSimClockGatePwm0      = FSL_SIM_SCGC_BIT(1U, 24U),
    kSimClockGatePwmB1     = FSL_SIM_SCGC_BIT(1U, 25U),
    kSimClockGatePwmB2     = FSL_SIM_SCGC_BIT(1U, 26U),
    kSimClockGatePwmB3     = FSL_SIM_SCGC_BIT(1U, 27U),

    kSimClockGateEnet0      = FSL_SIM_SCGC_BIT(2U, 0U),
    kSimClockGateHsadc1    = FSL_SIM_SCGC_BIT(2U, 28U),

    kSimClockGateTrng      = FSL_SIM_SCGC_BIT(3U, 0U),
    kSimClockGateFlexcan2  = FSL_SIM_SCGC_BIT(3U, 4U),
    kSimClockGateSpi2      = FSL_SIM_SCGC_BIT(3U, 12U),

    kSimClockGateEwm0      = FSL_SIM_SCGC_BIT(4U, 1U),
    kSimClockGateI2c0      = FSL_SIM_SCGC_BIT(4U, 6U),
    kSimClockGateI2c1      = FSL_SIM_SCGC_BIT(4U, 7U),
    kSimClockGateUart0     = FSL_SIM_SCGC_BIT(4U, 10U),
    kSimClockGateUart1     = FSL_SIM_SCGC_BIT(4U, 11U),
    kSimClockGateUart2     = FSL_SIM_SCGC_BIT(4U, 12U),
    kSimClockGateUart3     = FSL_SIM_SCGC_BIT(4U, 13U),
    kSimClockGateCmp       = FSL_SIM_SCGC_BIT(4U, 19U),
    kSimClockGatePwmA0     = FSL_SIM_SCGC_BIT(4U, 24U),
    kSimClockGatePwmA1     = FSL_SIM_SCGC_BIT(4U, 25U),
    kSimClockGatePwmA2     = FSL_SIM_SCGC_BIT(4U, 26U),
    kSimClockGatePwmA3     = FSL_SIM_SCGC_BIT(4U, 27U),

    kSimClockGateLptmr0    = FSL_SIM_SCGC_BIT(5U, 0U),
    kSimClockGatePortA     = FSL_SIM_SCGC_BIT(5U, 9U),
    kSimClockGatePortB     = FSL_SIM_SCGC_BIT(5U, 10U),
    kSimClockGatePortC     = FSL_SIM_SCGC_BIT(5U, 11U),
    kSimClockGatePortD     = FSL_SIM_SCGC_BIT(5U, 12U),
    kSimClockGatePortE     = FSL_SIM_SCGC_BIT(5U, 13U),
    kSimClockGateEnc0      = FSL_SIM_SCGC_BIT(5U, 21U),
    kSimClockGateXbarA     = FSL_SIM_SCGC_BIT(5U, 25U),
    kSimClockGateXbarB     = FSL_SIM_SCGC_BIT(5U, 26U),
    kSimClockGateAoi0      = FSL_SIM_SCGC_BIT(5U, 27U),
    kSimClockGateHsadc0    = FSL_SIM_SCGC_BIT(5U, 28U),

    kSimClockGateFtf0      = FSL_SIM_SCGC_BIT(6U, 0U),
    kSimClockGateDmamux0   = FSL_SIM_SCGC_BIT(6U, 1U),
    kSimClockGateFlexcan0  = FSL_SIM_SCGC_BIT(6U, 4U),
    kSimClockGateFlexcan1  = FSL_SIM_SCGC_BIT(6U, 5U),
    kSimClockGateFtm3      = FSL_SIM_SCGC_BIT(6U, 6U),
    kSimClockGateSpi0      = FSL_SIM_SCGC_BIT(6U, 12U),
    kSimClockGateSpi1      = FSL_SIM_SCGC_BIT(6U, 13U),
    kSimClockGatePdb1      = FSL_SIM_SCGC_BIT(6U, 17U),
    kSimClockGateCrc0      = FSL_SIM_SCGC_BIT(6U, 18U),
    kSimClockGatePdb0      = FSL_SIM_SCGC_BIT(6U, 22U),
    kSimClockGatePit0      = FSL_SIM_SCGC_BIT(6U, 23U),
    kSimClockGateFtm0      = FSL_SIM_SCGC_BIT(6U, 24U),
    kSimClockGateFtm1      = FSL_SIM_SCGC_BIT(6U, 25U),
    kSimClockGateFtm2      = FSL_SIM_SCGC_BIT(6U, 26U),
    kSimClockGateAdc0      = FSL_SIM_SCGC_BIT(6U, 27U),
    kSimClockGateDac0      = FSL_SIM_SCGC_BIT(6U, 31U),

    kSimClockGateDma0      = FSL_SIM_SCGC_BIT(7U, 8U),
    kSimClockGateMPU       = FSL_SIM_SCGC_BIT(7U, 2U),
    kSimClockGateFlexbus0   = FSL_SIM_SCGC_BIT(7U, 0U),
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_clock_gate_name_kv58f24_t;
#else
} sim_clock_gate_name_t;
#endif


/*! @brief SIM USB voltage regulator in standby mode setting during stop modes */
typedef enum _sim_usbsstby_stop
{
    kSimUsbsstbyNoRegulator,        /* regulator not in standby during Stop modes */
    kSimUsbsstbyWithRegulator       /* regulator in standby during Stop modes */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_usbsstby_stop_kv58f24_t;
#else
} sim_usbsstby_stop_t;
#endif

/*! @brief SIM USB voltage regulator in standby mode setting during VLPR and VLPW modes */
typedef enum _sim_usbvstby_stop
{
    kSimUsbvstbyNoRegulator,        /* regulator not in standby during VLPR and VLPW modes */
    kSimUsbvstbyWithRegulator       /* regulator in standby during VLPR and VLPW modes */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_usbvstby_stop_kv58f24_t;
#else
} sim_usbvstby_stop_t;
#endif

/*! @brief SIM CMT/UART pad drive strength */
typedef enum _sim_cmtuartpad_strengh
{
    kSimCmtuartSinglePad,           /* Single-pad drive strength for CMT IRO or UART0_TXD */
    kSimCmtuartDualPad              /* Dual-pad drive strength for CMT IRO or UART0_TXD */
#if (defined(DOXYGEN_OUTPUT) && (DOXYGEN_OUTPUT))
} sim_cmtuartpad_strengh_kv58f24_t;
#else
} sim_cmtuartpad_strengh_t;
#endif

