ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR-KV58F220M/SDK/platform/hal/src/sim/MKV58F24/fsl_sim_hal_MKV58F24.h
/*!
 *
 * @brief get Synchronization of XBARA's Input PIT Trigger X with fast clock 
 * 
 * This function returns the status of the synchronizer between PIT trigger X and XBARA's input.
 *
 * @param base Base address for current SIM instance.
 * @param instance Pit trigger number
 * @return 0 - Not synchronizeed, 1- Synchronized
 *END**************************************************************************/
bool SIM_HAL_GetSyncXbarAPittrigXcmd(SIM_Type* base, uint32_t instance);

/*!
 *
 * @brief Synchronize XBARB's Input PIT Trigger X with fast clock 
 * 
 * This function enables the synchronizer between PIT trigger X and XBARB's input.
 *
 * @param base Base address for current SIM instance.
 * @param instance Pit trigger number
 *END**************************************************************************/
void SIM_HAL_EnableSyncXbarBPittrigX(SIM_Type* base, uint32_t instance);

/*!
 *
 * @brief Synchronize XBARB's Input PIT Trigger X with fast clock 
 * 
 * This function disables the synchronizer between PIT trigger X and XBARB's input.
 *
 * @param base Base address for current SIM instance.
 * @param instance Pit trigger number
 *END**************************************************************************/
void SIM_HAL_DisableSyncXbarBPittrigX(SIM_Type* base, uint32_t instance);

/*!
 *
 * @brief get Synchronization of XBARB's Input PIT Trigger X with fast clock 
 * 
 * This function returns the status of the synchronizer between PIT trigger X and XBARB's input.
 *
 * @param base Base address for current SIM instance.
 * @param instance Pit trigger number
 * @return 0 - Not synchronizeed, 1- Synchronized
 *END**************************************************************************/
bool SIM_HAL_GetSyncXbarBPittrigXcmd(SIM_Type* base, uint32_t instance);

/*!
 *
 * @brief Synchronize XBARA's output for DAC Hardware Trigger with flash/slow clock
 *
 * This function controls the synchronizer between XBARA's output and DAC hardware trigger.
 *
 * @param base Base address for current SIM instance.
 *END**************************************************************************/
void SIM_HAL_EnableSyncXbarDac(SIM_Type* base);

/*!
 *
 * @brief Synchronize XBARA's output for DAC Hardware Trigger with flash/slow clock
 *
 * This function Disables  the synchronizer  between XBARA's output and DAC hardware trigger
 *
 * @param base Base address for current SIM instance.
 *END**************************************************************************/
void SIM_HAL_DisableSyncXbarDac(SIM_Type* base);

/*!
 *
 * @brief Get the synchronizer cmd between XBARA's output and DAC hardware trigger
 *
 * @param base Base address for current SIM instance.
 * @return state true - synchronizer enabled, false - synchronizer disabled
 *END**************************************************************************/
bool SIM_HAL_GetSyncXbarDaccmd(SIM_Type* base);

/*!
 *
 * @brief Get the synchronizer cmd between XBARA's output  and EWM's ewm_in
 *
 * This function enables the synchronizer between XBARA's output and EWM's ewm_in
 *
 * @param base Base address for current SIM instance.
 *END**************************************************************************/
void SIM_HAL_EnableSyncXbarEwmin(SIM_Type* base);

/*!
 *
 * @brief Disable  the synchronizer  between XBARA's output and EWM's ewm_in
 *
 * This function Disables  the synchronizer  between XBARA's output and EWM's ewm_in
 *
 * @param base Base address for current SIM instance.
 *END**************************************************************************/
void SIM_HAL_DisableSyncXbarEwmin(SIM_Type* base);

/*!
 *
 * @brief Get the synchronizer cmd between XBARA's output  and EWM's ewm_in
 *
 * @param base Base address for current SIM instance.
 * @return state true - synchronizer enabled, false - synchronizer disabled
 *END**************************************************************************/
bool SIM_HAL_GetSyncXbarEwmincmd(SIM_Type* base);

/*!
 *
 * @brief Enable the the synchronizer between XBARA's output and CMPx's sample/window input
 *
 * This function enables the the synchronizer between XBARA's output and CMPx's sample/window input
 *
 * @param base Base address for current SIM instance.
 * @param instance comparator instance  
 *END**************************************************************************/
void SIM_HAL_EnableSyncXbarCmpX(SIM_Type* base, uint32_t instance);

/*!
 *
 * @brief Disable the synchronizer between XBARA's output and CMP3's sample/window input
 *
 * This function Disables the synchronizer between XBARA's output and CMP3's sample/window input
 *
 * @param base Base address for current SIM instance.
 * @param instance comparator instance  
 *END**************************************************************************/
void SIM_HAL_DisableSyncXbarCmpX(SIM_Type* base, uint32_t instance);

/*!
 *
 * @brief  Get the synchronizer cmd between XBARA's output and CMP3's sample/window input
 *
 * @param base Base address for current SIM instance.
 * @param instance comparator instance
 * @return state true - synchronizer enabled, false - synchronizer disabled
 *END**************************************************************************/
bool SIM_HAL_GetSyncXbarCmpXcmd(SIM_Type* base, uint32_t instance);

/*!
 *
 * @brief Set CMP Sample/Window Input X Source
 *
 * This function controls the sample/window source of CMP module
 *
 * @param base Base address for current SIM instance.
 * @param instance comparator instance 
 * @param select CMP Sample/Window Input X Source
 * 00 XBARA output - refer RM for specific cmp instance
 * 01 CMPx Sample/Window input is driven by both PDB0 and PDB1 pulse-out channel 0.
 * 10 PDB0 pulse-out channel 0.
 * 11 PDB1 pulse-out channel 0.
 *END**************************************************************************/
void SIM_HAL_SetCmpWinxSrc(SIM_Type* base, uint32_t instance,
                                      sim_cmp_win_in_src select);

/*!
 *
 * @brief Get CMP Sample/Window Input X Source
 *
 * This function will get the sample/window source of CMP module
 *
 * @param base Base address for current SIM instance.
 * @param instance comparator instance 
 * @return select CMP Sample/Window Input X Source
 * 00 XBARA output - refer RM for specific cmp instance
 * 01 CMPx Sample/Window input is driven by both PDB0 and PDB1 pulse-out channel 0.
 * 10 PDB0 pulse-out channel 0.
 * 11 PDB1 pulse-out channel 0.
 *END**************************************************************************/
sim_cmp_win_in_src SIM_HAL_GetCmpWinxSrc(SIM_Type* base, uint32_t instance);

/*!
 *
 * @brief Set EWM_IN source setting
 *
 * This function controls the ewm_in source of EWM module
 *
 * @param base Base address for current SIM instance.
 * @param select EWM_IN source , 0-XBARA output 58, 1-EWM_IN pin
 * 
 *END**************************************************************************/
void SIM_HAL_SetEwmInSrc(SIM_Type* base, sim_ewm_in_src select);

/*!
 *
 * @brief Get EWM_IN source setting
 *
 * This function will get the ewm_in source of EWM module 
 * @param base Base address for current SIM instance.
 * @return select EWM_IN source , 0-XBARA output 58, 1-EWM_IN pin
 *
 *END**************************************************************************/
sim_ewm_in_src SIM_HAL_GetEwmInSrc(SIM_Type* base);

/*!
 *
 * @brief Set DAC x Hardware trigger source setting
 *
 * This function will select the DAC0 Hardware Trigger Input Source
 *
 * @param base Base address for current SIM instance.
 * @param select DAC0 Hardware Trigger Input Source
 * 00 XBARA output 15.
 * 01 DAC0 can be triggered by both PDB0 interval trigger 0 and PDB1 interval trigger 0.
 * 10 PDB0 interval trigger 0
 * 11 PDB1 interval trigger 0
 *END**************************************************************************/
void SIM_HAL_SetDacHwTrigSrc(SIM_Type* base,sim_dac_hw_trg_sel select);

/*!
 *
 * @brief Get DAC x Hardware trigger source setting
 *
 * This function will get the DAC0 Hardware Trigger Input Source
 *
 * @param base Base address for current SIM instance.
 * @param instance DAC instance.
 * @return select DAC0 Hardware Trigger Input Source
 * 00 XBARA output 15.
 * 01 DAC0 can be triggered by both PDB0 interval trigger 0 and PDB1 interval trigger 0.
 * 10 PDB0 interval trigger 0
 * 11 PDB1 interval trigger 0
 *END**************************************************************************/
sim_dac_hw_trg_sel SIM_HAL_GetDacHwTrigSrc(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for PIT module.
 *
 * This function enables the clock for PIT module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnablePitClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for PIT module.
 *
 * This function disables the clock for PIT module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisablePitClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for PIT module.
 *
 * This function will get the clock gate state for PIT module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetPitGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for LPTIMER module.
 *
 * This function enables the clock for LPTIMER module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableLptmrClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for LPTIMER module.
 *
 * This function disables the clock for LPTIMER module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableLptmrClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for LPTIMER module.
 *
 * This function will get the clock gate state for LPTIMER module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetLptmrGateCmd(SIM_Type* base, uint32_t instance);


/*!
 * @brief Enable the clock for FLEXCAN module.
 *
 * This function enables the clock for FLEXCAN module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableFlexcanClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for FLEXCAN module.
 *
 * This function disables the clock for FLEXCAN module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableFlexcanClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for FLEXCAN module.
 *
 * This function will get the clock gate state for FLEXCAN module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetFlexcanGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for SPI module.
 *
 * This function enables the clock for SPI module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableSpiClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for SPI module.
 *
 * This function disables the clock for SPI module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableSpiClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for SPI module.
 *
 * This function will get the clock gate state for SPI module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetSpiGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for I2C module.
 *
 * This function enables the clock for I2C module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableI2cClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for I2C module.
 *
 * This function disables the clock for I2C module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableI2cClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for I2C module.
 *
 * This function will get the clock gate state for I2C module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetI2cGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for UART module.
 *
 * This function enables the clock for UART module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableUartClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for UART module.
 *
 * This function disables the clock for UART module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableUartClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for UART module.
 *
 * This function will get the clock gate state for UART module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetUartGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for eFlexPWM module.
 *
 * This function enables the clock for eFlexPWM module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @param channel PWM module channel
 */
void SIM_HAL_EnablePwmClock(SIM_Type* base, uint32_t instance, uint8_t channel);

/*!
 * @brief Disable the clock for eFlexPWM module.
 *
 * This function disables the clock for eFlexPWM module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @param channel PWM module channel
 */
void SIM_HAL_DisablePwmClock(SIM_Type* base, uint32_t instance, uint8_t channel);

/*!
 * @brief Get the the clock gate state for eFlexPWM module.
 *
 * This function will get the clock gate state for eFlexPWM module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @param channel PWM module channel
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetPwmGateCmd(SIM_Type* base, uint32_t instance, uint8_t channel);

/*!
 * @brief Enable the clock for AOI module.
 *
 * This function enables the clock for AOI module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableAoiClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for AOI module.
 *
 * This function disables the clock for AOI module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableAoiClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for AOI module.
 *
 * This function will get the clock gate state for AOI module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetAoiGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for XBAR module.
 *
 * This function enables the clock for XBAR module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableXbarClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for XBAR module.
 *
 * This function disables the clock for XBAR module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableXbarClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for XBAR module.
 *
 * This function will get the clock gate state for XBAR module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetXbarGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for ENC module.
 *
 * This function enables the clock for ENC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableEncClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for ENC module.
 *
 * This function disables the clock for ENC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableEncClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for ENC module.
 *
 * This function will get the clock gate state for ENC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetEncGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for FLEXBUS module.
 *
 * This function enables the clock for FLEXBUS module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableFlexbusClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for FLEXBUS module.
 *
 * This function disables the clock for FLEXBUS module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableFlexbusClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for FLEXBUS module.
 *
 * This function will get the clock gate state for FLEXBUS module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetFlexbusGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for HSADC module.
 *
 * This function enables the clock for HSADC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableHsadcClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for HSADC module.
 *
 * This function disables the clock for HSADC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableHsadcClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for HSADC module.
 *
 * This function will get the clock gate state for HSADC module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetHsadcGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for ENET module.
 *
 * This function enables the clock for ENET module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableEnetClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for ENET module.
 *
 * This function disables the clock for ENET module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableEnetClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for ENET module.
 *
 * This function will get the clock gate state for ENET module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetEnetGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for MPU module.
 *
 * This function enables the clock for MPU module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableMpuClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for MPU module.
 *
 * This function disables the clock for MPU module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableMpuClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for MPU module.
 *
 * This function will get the clock gate state for MPU module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetMpuGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Enable the clock for TRNG module.
 *
 * This function enables the clock for TRNG module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_EnableTrngClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Disable the clock for TRNG module.
 *
 * This function disables the clock for TRNG module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 */
void SIM_HAL_DisableTrngClock(SIM_Type* base, uint32_t instance);

/*!
 * @brief Get the the clock gate state for TRNG module.
 *
 * This function will get the clock gate state for TRNG module.
 *
 * @param base Base address for current SIM instance.
 * @param instance module device instance
 * @return state true - ungated(Enabled), false - gated (Disabled)
 */
bool SIM_HAL_GetTrngGateCmd(SIM_Type* base, uint32_t instance);

/*!
 * @brief Set the clock selection of ERCLK32K.
 *
 * This function sets the clock selection of ERCLK32K.
 *
 * @param base Base address for current SIM instance.
 * @param setting  The value to set.
 */
static inline void CLOCK_HAL_SetExternalRefClock32kSrc(SIM_Type* base,
                                                       clock_er32k_src_t setting)
{
    SIM_BWR_SOPT1_OSC32KSEL(base, setting);
}

/*!
 * @brief Get the clock selection of ERCLK32K.
 *
 * This function gets the clock selection of ERCLK32K.
 *
 * @param base Base address for current SIM instance.
 * @return Current selection.
 */
static inline clock_er32k_src_t CLOCK_HAL_GetExternalRefClock32kSrc(SIM_Type* base)
{
    return (clock_er32k_src_t)SIM_BRD_SOPT1_OSC32KSEL(base);
}
/*!
 * @brief Set PLL/FLL clock selection.
 *
 * This function sets the selection of the high frequency clock for
 * various peripheral clocking options
 *
 * @param base Base address for current SIM instance.
 * @param setting  The value to set.
 */
static inline void CLOCK_HAL_SetPllfllSel(SIM_Type * base,
                                          clock_pllfll_sel_t setting)
{
    SIM_BWR_SOPT2_PLLFLLSEL(base, setting);
}

/*!
 * @brief Get PLL/FLL clock selection.
 *
 * This function gets the selection of the high frequency clock for
 * various peripheral clocking options
 *
 * @param base Base address for current SIM instance.
 * @return Current selection.
 */
static inline clock_pllfll_sel_t CLOCK_HAL_GetPllfllSel(SIM_Type * base)
{
    return (clock_pllfll_sel_t)SIM_BRD_SOPT2_PLLFLLSEL(base);
}

