ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR-KV58F220M/SDK/platform/hal/src/sim/MKV58F24/fsl_sim_hal_MKV58F24.h
/*!
 * @brief Set CLKOUTSEL selection.
 *
 * This function sets the selection of the clock to output on the CLKOUT pin.
 *
 * @param base Base address for current SIM instance.
 * @param setting  The value to set.
 */
static inline void CLOCK_HAL_SetClkOutSel(SIM_Type * base, clock_clkout_src_t setting)
{
    SIM_BWR_SOPT2_CLKOUTSEL(base, setting);
}

/*!
 * @brief Get CLKOUTSEL selection.
 *
 * This function gets the selection of the clock to output on the CLKOUT pin.
 *
 * @param base Base address for current SIM instance.
 * @return Current selection.
 */
static inline clock_clkout_src_t CLOCK_HAL_GetClkOutSel(SIM_Type * base)
{
    return (clock_clkout_src_t)SIM_BRD_SOPT2_CLKOUTSEL(base);
}

/*!
 * @brief Set debug trace clock selection.
 *
 * This function sets debug trace clock selection.
 *
 * @param base Base address for current SIM instance.
 * @param setting  The value to set.
 */
static inline void CLOCK_HAL_SetTraceClkSrc(SIM_Type* base, clock_trace_src_t setting)
{
    SIM_BWR_SOPT2_TRACECLKSEL(base, setting);
}

/*!
 * @brief Get debug trace clock selection.
 *
 * This function gets debug trace clock selection.
 *
 * @param base Base address for current SIM instance.
 * @return Current selection.
 */
static inline clock_trace_src_t CLOCK_HAL_GetTraceClkSrc(SIM_Type* base)
{
    return (clock_trace_src_t)SIM_BRD_SOPT2_TRACECLKSEL(base);
}

/*!
 * @brief Get Nanoedge PMC Status
 *
 * This function gets Nanoedge power supply status.
 *
 * @param base Base address for current SIM instance.
 * @return power supply status.
 */
static inline bool CLOCK_HAL_GetNanoedgePMCStatus(SIM_Type* base)
{
    return (bool)SIM_BRD_PWRC_SRPWROK(base);
}
/*@}*/

/*!
 * @brief Set Nanoedge PMC POWER Ready
 *
 * This function sets soft control to indicate nanoedge PMC is ready,
 * when PMC Power dectect is disabled by SRPWRDETEN
 * @param base Base address for current SIM instance.
 * @param select power supply status.
 */
static inline void CLOCK_HAL_SetNanoedgePMCPwrRdy(SIM_Type* base, bool select)
{
    SIM_BWR_PWRC_SRPWRRDY(base, select);
}

/*!
 * @brief Get Nanoedge PMC POWER Ready
 *
 * This function gets soft control to indicate nanoedge PMC is ready.
 *
 * @param base Base address for current SIM instance.
 * @return power supply status.
 */
static inline bool CLOCK_HAL_GetNanoedgePMCPwrRdy(SIM_Type* base)
{
    return (bool)SIM_BRD_PWRC_SRPWRRDY(base);
}
/*@}*/

/*!
 * @brief Nanoedge PMC POWER Dectect Enable
 *
 * enable Nanoedge PMC power dectect to assert PMC ready signal when PMC is stable.
 *
 * @param base Base address for current SIM instance.
 * 
 */
static inline void CLOCK_HAL_EnableNanoedgePmcPowerDectect (SIM_Type* base)
{
    SIM_BWR_PWRC_SRPWRDETEN(base, 1);
}

/*!
 * @brief Nanoedge PMC POWER Dectect Disable
 *
 * disable Nanoedge PMC power dectect to assert PMC ready signal when PMC is stable.
 *
 * @param base Base address for current SIM instance.
 * 
 */
static inline void CLOCK_HAL_DisableNanoedgePmcPowerDectect (SIM_Type* base)
{
    SIM_BWR_PWRC_SRPWRDETEN(base, 0);
}

/*!
 * @brief Get Nanoedge PMC POWER Dectect
 *
 * This function gets Nanoedge PMC power dectect to assert PMC ready signal when PMC is stable
 *
 * @param base Base address for current SIM instance.
 * @return PMC power dectect status.
 */
static inline bool CLOCK_HAL_GetNanoedgePmcPowerDectectcmd(SIM_Type* base)
{
    return (bool)SIM_BRD_PWRC_SRPWRDETEN(base);
}

/*!
 * @brief Get HSADC Clock Status
 *
 * This function returns which clock is fed in HSADC.
 * 0 HSADC clock is fast peripherial clock.
 * 1 HSADC clock is MCGIRCLK.
 *
 * @param base Base address for current SIM instance.
 * @return HSADC Clock Status.
 */
static inline bool CLOCK_HAL_GetHsadcClkStatus(SIM_Type* base)
{
    return (bool)SIM_BRD_ADCOPT_HSADCIRCLK(base);
}

/*!
 * @brief Enable HSADC low current Mode
 *
 * Control HSADC low current mode in STOP and VLPS mode.
 *
 * @param base Base address for current SIM instance.
 * 
 */
static inline void CLOCK_HAL_EnableHsadcLowCurrentMode(SIM_Type* base)
{
    SIM_BWR_ADCOPT_HSADCSTOPEN(base, 1);
}

/*!
 * @brief Disable HSADC low current Mode
 *
 * Control HSADC low current mode in STOP and VLPS mode.
 *
 * @param base Base address for current SIM instance.
 * 
 */
static inline void CLOCK_HAL_DisableHsadcLowCurrentMode(SIM_Type* base)
{
    SIM_BWR_ADCOPT_HSADCSTOPEN(base, 0);
}

/*!
 * @brief Get HSADC low current Mode
 *
 * This function gets HSADC low current mode in STOP and VLPS mode.
 *
 * @param base Base address for current SIM instance.
 * @return HSADC low current mode status.
 */
static inline bool CLOCK_HAL_GetHsadcLowCurrentModecmd(SIM_Type* base)
{
    return (bool)SIM_BRD_ADCOPT_HSADCSTOPEN(base);
}
/*@}*/

#if defined(__cplusplus)
}
#endif /* __cplusplus*/


/*! @}*/

#endif /* __FSL_SIM_HAL_MKV58F24_H__*/
/*******************************************************************************
 * EOF
 ******************************************************************************/

